zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ks_reg.h
#define KS_OTPSTS_KEY8_Pos               (8)                                               /*!< KS_T::OTPSTS: KEY8 Position            */
#define KS_OTPSTS_KEY8_Msk               (0x1ul << KS_OTPSTS_KEY8_Pos)                     /*!< KS_T::OTPSTS: KEY8 Mask                */

#define KS_OTPSTS_KEY9_Pos               (9)                                               /*!< KS_T::OTPSTS: KEY9 Position            */
#define KS_OTPSTS_KEY9_Msk               (0x1ul << KS_OTPSTS_KEY9_Pos)                     /*!< KS_T::OTPSTS: KEY9 Mask                */

#define KS_OTPSTS_KEY10_Pos              (10)                                              /*!< KS_T::OTPSTS: KEY10 Position           */
#define KS_OTPSTS_KEY10_Msk              (0x1ul << KS_OTPSTS_KEY10_Pos)                    /*!< KS_T::OTPSTS: KEY10 Mask               */

#define KS_OTPSTS_KEY11_Pos              (11)                                              /*!< KS_T::OTPSTS: KEY11 Position           */
#define KS_OTPSTS_KEY11_Msk              (0x1ul << KS_OTPSTS_KEY11_Pos)                    /*!< KS_T::OTPSTS: KEY11 Mask               */

#define KS_OTPSTS_KEY12_Pos              (12)                                              /*!< KS_T::OTPSTS: KEY12 Position           */
#define KS_OTPSTS_KEY12_Msk              (0x1ul << KS_OTPSTS_KEY12_Pos)                    /*!< KS_T::OTPSTS: KEY12 Mask               */

#define KS_OTPSTS_KEY13_Pos              (13)                                              /*!< KS_T::OTPSTS: KEY13 Position           */
#define KS_OTPSTS_KEY13_Msk              (0x1ul << KS_OTPSTS_KEY13_Pos)                    /*!< KS_T::OTPSTS: KEY13 Mask               */

#define KS_OTPSTS_KEY14_Pos              (14)                                              /*!< KS_T::OTPSTS: KEY14 Position           */
#define KS_OTPSTS_KEY14_Msk              (0x1ul << KS_OTPSTS_KEY14_Pos)                    /*!< KS_T::OTPSTS: KEY14 Mask               */

#define KS_OTPSTS_KEY15_Pos              (15)                                              /*!< KS_T::OTPSTS: KEY15 Position           */
#define KS_OTPSTS_KEY15_Msk              (0x1ul << KS_OTPSTS_KEY15_Pos)                    /*!< KS_T::OTPSTS: KEY15 Mask               */

#define KS_REMKCNT_RRMKCNT_Pos           (0)                                               /*!< KS_T::REMKCNT: RRMKCNT Position        */
#define KS_REMKCNT_RRMKCNT_Msk           (0x3ful << KS_REMKCNT_RRMKCNT_Pos)                /*!< KS_T::REMKCNT: RRMKCNT Mask            */

#define KS_REMKCNT_FRMKCNT_Pos           (16)                                              /*!< KS_T::REMKCNT: FRMKCNT Position        */
#define KS_REMKCNT_FRMKCNT_Msk           (0x3ful << KS_REMKCNT_FRMKCNT_Pos)                /*!< KS_T::REMKCNT: FRMKCNT Mask            */

/** @} KS_CONST */
/** @} end of KS register group */
/** @} end of REGISTER group */

#endif /* __KS_REG_H__ */
